{
  "backend/main.mo": "Motoko actor storing per-user progress and exposing methods to initialize, update, fetch user progress, and return predefined message lists.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, and test IDs for the scrapbook single‑page experience.",
  "frontend-file-summaries.txt": "Collection of short descriptions summarizing all major frontend components, pages, hooks, and configuration files.",
  "frontend/index.css": "Global Tailwind-based styling defining color variables, theming for light/dark modes, and base layout rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component providing QueryClient and ThemeProvider, rendering ScrapbookSinglePage and Toaster.",
  "frontend/src/components/Confetti.tsx": "React component generating falling confetti pieces with configurable intensity.",
  "frontend/src/components/FloatingHearts.tsx": "Component spawning and animating floating heart particles at tap positions.",
  "frontend/src/components/journey/PolaroidCard.tsx": "Interactive polaroid card allowing image upload/removal and caption editing.",
  "frontend/src/components/MusicPlayer.tsx": "Floating music player allowing audio upload, play/pause, mute fade effects, and looping playback.",
  "frontend/src/components/sections/GrandFinaleSection.tsx": "Final reveal section showing a celebratory message, coupon card, and optional password‑gated video.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with a live countdown timer and a hint button that triggers a toast.",
  "frontend/src/components/sections/JourneySection.tsx": "Displays alternating paragraphs and PolaroidCard components based on journey config.",
  "frontend/src/components/sections/MusicSection.tsx": "Simple section prompting users to use the floating music player and showing a themed quote.",
  "frontend/src/components/sections/OurSpotsSection.tsx": "Shows a decorative map with clickable pins that open popovers describing special locations.",
  "frontend/src/components/sections/TeaseSection.tsx": "Renders a grid of EnvelopeCard components representing secret messages.",
  "frontend/src/components/surprise/PasswordGate.tsx": "Password-protected gate that unlocks child content after validating a secret code.",
  "frontend/src/components/surprise/VideoMessagePanel.tsx": "Panel showing an embedded video or a placeholder message if no video URL is configured.",
  "frontend/src/components/tease/EnvelopeCard.tsx": "Hover/click‑activated envelope card that reveals a message when opened.",
  "frontend/src/config/scrapbookConfig.ts": "Defines the full scrapbook birthday experience configuration including hero text, journey paragraphs, tease messages, map pins, finale content, and a password-protected surprise.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor using react-query, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity restoration, and client initialization.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for fetching and mutating love-letter data, teasing messages, final messages, and user progress via the backend actor.",
  "frontend/src/index.css": "Sets global Tailwind layers, theme variables, scrapbook textures, and utility styles including light/dark theme color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/FinalSection.tsx": "Empty placeholder page component.",
  "frontend/src/pages/LandingScreen.tsx": "Empty placeholder page component.",
  "frontend/src/pages/LoveLetter.tsx": "Empty placeholder page component.",
  "frontend/src/pages/MemoryLane.tsx": "Empty placeholder page component.",
  "frontend/src/pages/PhotoUpload.tsx": "Empty placeholder page component.",
  "frontend/src/pages/ScrapbookSinglePage.tsx": "Renders the full scrapbook single-page experience with sections, music, interactions, and footer, using scrapbookConfig.",
  "frontend/src/pages/SurpriseButtons.tsx": "Empty placeholder page component.",
  "frontend/src/pages/TeasingSection.tsx": "Empty placeholder page component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color tokens, extended theme settings, plugins, and content paths.",
  "project_state.json": "Defines the project’s mobile‑first scrapbook‑style birthday website vision, required images, and implemented features. Includes architectural notes, a detailed feature list, and configuration for sections like the hero, journey, music, and finale."
}